Rahix/avr-device/vendor/atmega328.atdf
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register Bytes" name="EEAR" offset="0x41" size="2" mask="0x03FF">
          <bitfield caption="EEPROM Address Bits" mask="0x03FF" name="EEAR"/>
        </register>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF">
          <bitfield caption="EEPROM Data Bits" mask="0xFF" name="EEDR"/>
        </register>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
        <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
        <value caption="Write Only" name="VAL_0x02" value="0x02"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Power Reduction Register" name="PRR" offset="0x64" size="1" ocd-rw="R">
          <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
          <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
          <bitfield caption="Power Reduction USART" mask="0x02" name="PRUSART0"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
          <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
          <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x0FFF"/>
        <register caption="Store Program Memory Control and Status Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read-While-Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read-While-Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory" mask="0x01" name="SPMEN"/>
        </register>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="" mask="0x10" name="PUD"/>
          <bitfield caption="" mask="0x02" name="IVSEL"/>
          <bitfield caption="" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select Bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS2"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="General Purpose I/O Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF">
          <bitfield caption="General Purpose I/O bits" mask="0xFF" name="GPIOR2"/>
        </register>
        <register caption="General Purpose I/O Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF">
          <bitfield caption="General Purpose I/O bits" mask="0xFF" name="GPIOR1"/>
        </register>
        <register caption="General Purpose I/O Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF">
          <bitfield caption="General Purpose I/O bits" mask="0xFF" name="GPIOR0"/>
        </register>
      </register-group>
      <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="4" name="VAL_0x02" value="0x02"/>
        <value caption="8" name="VAL_0x03" value="0x03"/>
        <value caption="16" name="VAL_0x04" value="0x04"/>
        <value caption="32" name="VAL_0x05" value="0x05"/>
        <value caption="64" name="VAL_0x06" value="0x06"/>
        <value caption="128" name="VAL_0x07" value="0x07"/>
        <value caption="256" name="VAL_0x08" value="0x08"/>
      </value-group>
      <value-group caption="" name="CPU_SLEEP_MODE_3BITS2">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>

    </module>
  </modules>
  <pinouts>
    <pinout name="TQFP32" caption="TQFP32">
      <pin position="1" pad="PD3"/>
      <pin position="2" pad="PD4"/>
      <pin position="3" pad="GND"/>
      <pin position="4" pad="VCC"/>
      <pin position="5" pad="GND"/>
      <pin position="6" pad="VCC"/>
      <pin position="7" pad="PB6"/>
      <pin position="8" pad="PB7"/>
      <pin position="9" pad="PD5"/>
      <pin position="10" pad="PD6"/>
      <pin position="11" pad="PD7"/>
      <pin position="12" pad="PB0"/>
      <pin position="13" pad="PB1"/>
      <pin position="14" pad="PB2"/>
      <pin position="15" pad="PB3"/>
      <pin position="16" pad="PB4"/>
      <pin position="17" pad="PB5"/>
      <pin position="18" pad="AVCC"/>
      <pin position="19" pad="ADC6"/>
      <pin position="20" pad="AREF"/>
      <pin position="21" pad="GND"/>
      <pin position="22" pad="ADC7"/>
      <pin position="23" pad="PC0"/>
      <pin position="24" pad="PC1"/>
      <pin position="25" pad="PC2"/>
      <pin position="26" pad="PC3"/>
      <pin position="27" pad="PC4"/>
      <pin position="28" pad="PC5"/>
      <pin position="29" pad="PC6"/>
      <pin position="30" pad="PD0"/>
      <pin position="31" pad="PD1"/>
      <pin position="32" pad="PD2"/>
    </pinout>
    <pinout name="QFN32" caption="QFN32">
      <pin position="1" pad="PD3"/>
      <pin position="2" pad="PD4"/>
      <pin position="3" pad="GND"/>
      <pin position="4" pad="VCC"/>
      <pin position="5" pad="GND"/>
      <pin position="6" pad="VCC"/>
      <pin position="7" pad="PB6"/>
      <pin position="8" pad="PB7"/>
      <pin position="9" pad="PD5"/>
      <pin position="10" pad="PD6"/>
      <pin position="11" pad="PD7"/>
      <pin position="12" pad="PB0"/>
      <pin position="13" pad="PB1"/>
      <pin position="14" pad="PB2"/>
      <pin position="15" pad="PB3"/>
      <pin position="16" pad="PB4"/>
      <pin position="17" pad="PB5"/>
      <pin position="18" pad="AVCC"/>
      <pin position="19" pad="ADC6"/>
      <pin position="20" pad="AREF"/>
      <pin position="21" pad="GND"/>
      <pin position="22" pad="ADC7"/>
      <pin position="23" pad="PC0"/>
      <pin position="24" pad="PC1"/>
      <pin position="25" pad="PC2"/>
      <pin position="26" pad="PC3"/>
      <pin position="27" pad="PC4"/>
      <pin position="28" pad="PC5"/>
      <pin position="29" pad="PC6"/>
      <pin position="30" pad="PD0"/>
      <pin position="31" pad="PD1"/>
      <pin position="32" pad="PD2"/>
    </pinout>
    <pinout name="QFN28" caption="QFN28">
      <pin position="1" pad="PD3"/>
      <pin position="2" pad="PD4"/>
      <pin position="3" pad="VCC"/>
      <pin position="4" pad="GND"/>
      <pin position="5" pad="PB6"/>
      <pin position="6" pad="PB7"/>
      <pin position="7" pad="PD5"/>
      <pin position="8" pad="PD6"/>
      <pin position="9" pad="PD7"/>
      <pin position="10" pad="PB0"/>
      <pin position="11" pad="PB1"/>
      <pin position="12" pad="PB2"/>
      <pin position="13" pad="PB3"/>
      <pin position="14" pad="PB4"/>
      <pin position="15" pad="PB5"/>
      <pin position="16" pad="AVCC"/>
      <pin position="17" pad="AREF"/>
      <pin position="18" pad="GND"/>
      <pin position="19" pad="PC0"/>
      <pin position="20" pad="PC1"/>
      <pin position="21" pad="PC2"/>
      <pin position="22" pad="PC3"/>
      <pin position="23" pad="PC4"/>
      <pin position="24" pad="PC5"/>
      <pin position="25" pad="PC6"/>
      <pin position="26" pad="PD0"/>
      <pin position="27" pad="PD1"/>
      <pin position="28" pad="PD2"/>
    </pinout>
    <pinout name="PDIP28" caption="PDIP28">
      <pin position="1" pad="PC6"/>
      <pin position="2" pad="PD0"/>
      <pin position="3" pad="PD1"/>
      <pin position="4" pad="PD2"/>
      <pin position="5" pad="PD3"/>
      <pin position="6" pad="PD4"/>
      <pin position="7" pad="VCC"/>
      <pin position="8" pad="GND"/>
      <pin position="9" pad="PB6"/>
      <pin position="10" pad="PB7"/>
      <pin position="11" pad="PD5"/>
      <pin position="12" pad="PD6"/>
      <pin position="13" pad="PD7"/>
      <pin position="14" pad="PB0"/>
      <pin position="15" pad="PB1"/>
      <pin position="16" pad="PB2"/>
      <pin position="17" pad="PB3"/>
      <pin position="18" pad="PB4"/>
      <pin position="19" pad="PB5"/>
      <pin position="20" pad="AVCC"/>
      <pin position="21" pad="AREF"/>
      <pin position="22" pad="GND"/>
      <pin position="23" pad="PC0"/>
      <pin position="24" pad="PC1"/>
      <pin position="25" pad="PC2"/>
      <pin position="26" pad="PC3"/>
      <pin position="27" pad="PC4"/>
      <pin position="28" pad="PC5"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
